results/data/jvm-static/erik-laptop/quarkus-worker-pool-20000-MEASURE.wrk2.out
Running 1m test @ http://erik-pc.local:8080/greeting/Bob
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.911ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.825ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.345ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.746ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.70ms  838.77us   7.20ms   64.33%
    Req/Sec     5.28k   758.26     8.33k    83.01%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.53ms
 75.000%    2.30ms
 90.000%    2.94ms
 99.000%    3.69ms
 99.900%    4.20ms
 99.990%    4.86ms
 99.999%    6.38ms
100.000%    7.20ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.244     0.000000            1         1.00
       0.715     0.100000       100135         1.11
       0.918     0.200000       199966         1.25
       1.107     0.300000       299690         1.43
       1.296     0.400000       399427         1.67
       1.529     0.500000       498993         2.00
       1.677     0.550000       548830         2.22
       1.839     0.600000       598695         2.50
       2.000     0.650000       648513         2.86
       2.149     0.700000       698742         3.33
       2.297     0.750000       748393         4.00
       2.383     0.775000       773349         4.44
       2.483     0.800000       798203         5.00
       2.589     0.825000       822996         5.71
       2.701     0.850000       848303         6.67
       2.815     0.875000       873012         8.00
       2.875     0.887500       885570         8.89
       2.937     0.900000       897883        10.00
       3.007     0.912500       910311        11.43
       3.077     0.925000       922746        13.33
       3.155     0.937500       935286        16.00
       3.197     0.943750       941687        17.78
       3.239     0.950000       947749        20.00
       3.287     0.956250       954109        22.86
       3.339     0.962500       960187        26.67
       3.399     0.968750       966425        32.00
       3.433     0.971875       969598        35.56
       3.467     0.975000       972587        40.00
       3.505     0.978125       975747        45.71
       3.545     0.981250       978797        53.33
       3.591     0.984375       981987        64.00
       3.615     0.985938       983474        71.11
       3.643     0.987500       985100        80.00
       3.673     0.989062       986670        91.43
       3.705     0.990625       988184       106.67
       3.745     0.992188       989748       128.00
       3.769     0.992969       990495       142.22
       3.795     0.993750       991312       160.00
       3.823     0.994531       992089       182.86
       3.853     0.995313       992826       213.33
       3.893     0.996094       993613       256.00
       3.915     0.996484       994021       284.44
       3.941     0.996875       994399       320.00
       3.971     0.997266       994775       365.71
       4.005     0.997656       995169       426.67
       4.045     0.998047       995566       512.00
       4.067     0.998242       995763       568.89
       4.099     0.998437       995968       640.00
       4.127     0.998633       996146       731.43
       4.163     0.998828       996335       853.33
       4.207     0.999023       996532      1024.00
       4.231     0.999121       996639      1137.78
       4.255     0.999219       996729      1280.00
       4.287     0.999316       996820      1462.86
       4.331     0.999414       996924      1706.67
       4.391     0.999512       997026      2048.00
       4.411     0.999561       997066      2275.56
       4.439     0.999609       997111      2560.00
       4.491     0.999658       997160      2925.71
       4.551     0.999707       997208      3413.33
       4.603     0.999756       997259      4096.00
       4.643     0.999780       997282      4551.11
       4.675     0.999805       997306      5120.00
       4.711     0.999829       997331      5851.43
       4.747     0.999854       997354      6826.67
       4.799     0.999878       997379      8192.00
       4.839     0.999890       997391      9102.22
       4.875     0.999902       997403     10240.00
       4.911     0.999915       997415     11702.86
       5.023     0.999927       997427     13653.33
       5.123     0.999939       997440     16384.00
       5.195     0.999945       997446     18204.44
       5.231     0.999951       997452     20480.00
       5.279     0.999957       997458     23405.71
       5.319     0.999963       997464     27306.67
       5.363     0.999969       997470     32768.00
       5.435     0.999973       997473     36408.89
       5.527     0.999976       997476     40960.00
       5.587     0.999979       997479     46811.43
       6.007     0.999982       997482     54613.33
       6.147     0.999985       997485     65536.00
       6.239     0.999986       997487     72817.78
       6.295     0.999988       997488     81920.00
       6.383     0.999989       997490     93622.86
       6.455     0.999991       997491    109226.67
       6.711     0.999992       997493    131072.00
       6.735     0.999993       997494    145635.56
       6.735     0.999994       997494    163840.00
       6.747     0.999995       997495    187245.71
       6.843     0.999995       997496    218453.33
       6.847     0.999996       997497    262144.00
       6.847     0.999997       997497    291271.11
       6.847     0.999997       997497    327680.00
       7.027     0.999997       997498    374491.43
       7.027     0.999998       997498    436906.67
       7.059     0.999998       997499    524288.00
       7.059     0.999998       997499    582542.22
       7.059     0.999998       997499    655360.00
       7.059     0.999999       997499    748982.86
       7.059     0.999999       997499    873813.33
       7.203     0.999999       997500   1048576.00
       7.203     1.000000       997500          inf
#[Mean    =        1.700, StdDeviation   =        0.839]
#[Max     =        7.200, Total count    =       997500]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1198819 requests in 1.00m, 99.47MB read
Requests/sec:  19979.97
Transfer/sec:      1.66MB